applications/test/compressible/channelFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

//startFrom       latestTime;
startFrom       startTime;
startTime       0;

stopAt          endTime;

endTime         500;

deltaT          0.001;

// writeControl    adjustableRunTime;
writeControl timeStep;

writeInterval   50;

purgeWrite      5;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// adjustTimeStep  yes;

// maxCo           0.8;

// maxDeltaT       10;


functions
{
    #includeFunc residuals
    #includeFunc minMaxComponents
 //   #includeFunc streamlines
}

// ************************************************************************* //
