applications/test/compressible/channelFlow/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

direction       both;

seedSampleSet
{
    type            lineUniform;
    start           (0 0 0.01);
    end             (0 0.1 0.01);
    nPoints         24;
    axis            y;
}

fields          (U);

#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"

// ************************************************************************* //
